
{"intents": [

        {"tag": "Instate",
         "patterns": ["Almost all the production of rice is from the states",
            "Rice is majorly grown in states such as Telangana , Punjab, Haryana",
            "Rice is mainly produced in states such as Telangana , Punjab, Haryana",
            "It is preferable to grow rice in states such as Arunachal Pradesh, west Bengal, Punjab, Haryana", 
            "It is advicable to grow rice  in states such as Telangana, Harayan ,Punjab ",
            " The rice is majorly grown in good irrigation facilities Regions near ganga,rivers in states haryana, Uttar Pradesh",
            "Ranking on the 3rd position, Andhra Pradesh produces 128.95 lakh tons of rice in India.",
            "West Bengal,Telangana,Uttar Pradesh are the largest rice producing states in India. ",
            "West Bengal,Telangana,Uttar Pradesh are majorly rice producing states in India. ",
            "Rice is majorly cultivated in Punjab,Uttar Pradesh,Bihar,Arunachal Pradesh,West Bengal",
            "The rice is majorly cultivated in good irrigation facilities Regions near ganga,rivers in states haryana, Uttar Pradesh",
            "It is preferable to cultivate rice in states such as Arunachal Pradesh, west Bengal, Punjab, Haryana",
            "The three largest rice producing states are Andhra Pradesh,West Bengal",
            "Andhra Pradesh,West Bengal,punjab are the largest producers of rice",
            "In Andhra Pradesh,West Bengal,punjab are the largest rice producing states of India",
            "Rice is majorly farmed in states such as Telangana , Punjab, Haryana"],
         "responses": ["this is Largest producing states of rice in India"],
         "context_set": ""
        },

        {"tag": "equipment",
         "patterns": ["Equipments used for the production of rice are combine harvester,sickle",
            "harvester and sickle are the Equipments used for the production of rice",
            "Equipemnt used for the production of rice are shoots",
            "shoots are the Equipment used for the production of rice",
            "Equipemnt used for production of rice are wooden handheld tools",
            "wooden handheld tools are the Equipment used for the production of rice",
            "Plough is the Equipment used to get the soil ready for planting rice ",
            "rice plating is done with the use of Plough",
            "RotoTillers are the quipment used with deisel powered engine are used for preparing fields in rice production",
            "Field preparation of rice is made help of equipment roto Tillers",
            "Wooden handheld tools with flat metal blades are used for rice production for field preparation",
            "Transplantor machine is used for transplanting seeding to the field",
            "Transplantor equipment is used for transplanting seeding to the field",
            "Power weeder machine is used for removing the weeds",
            "Weeds are removed with the help of equipment Power weeder",
            "Rice combined harvester is used for harvesting the Rice",
            "Trays  of shoots are used for production of rice ",
            "rototillers with diesel powered engines are utilised to prepare fields for the production of Rice",
            "sickle is used for the cultivation of Rice",
            "Employment of sickle is used in the production of Rice",
            "sickle is used for the production of Rice",
            "sickle is the tool of choice in many  of the rice producing  states due to its low cost",
    "tractor, power tiller, paddy transplanter, cono weeder, power sprayer, combine harvester, thresher etc."
        ],
         "responses": ["These are the quipments used for the production of rice"],
         "context_set": ""
        },

        {"tag": "soilcondition",
         "patterns": ["fertile,reverine,alluvial soil is best for rice cultivation",
                "fertile soil is used for growing rice",
                "fertile soil is used for cultivation of soil",
                "rice is farmed in fertile,loam,clay,alluvial,reverine soil",
                "rice farming is done in alkaline and acid soils",
                "reverine soil is used for growing Rice",
                "alluvial soil is used for ice cultivation",
                "gravel,loams ans silts",
                "The suitable soil for growing soil is alluvial,loam ,reverine soil",
                "The best soil for growing rice is fertile,alluvial,loam,reverine soil",
                "gravel soil is used for growing rice",
                "rice is farmed in gravel type of soil",
                "rice cultivated in silt,loam ,alluvial soil",
                "loam soil is used for producing Rice",
                "silt soil is used for rice preparation",
                "rice production is suitable in fertile soil",
                "rice cultivation is done soil such as  in loam soil",
                "rice production is done in silt soil",
                "rice production is done in reverine soil",
                "rice is mainly produced in soil such as fertile,loam,alluvial,gravel soil"],
         "responses": ["the type of soil for growing Rice"],
         "context_set": ""
        }
        ,
        {
        "tag": "fertilizers",
         "patterns": ["cow dung and green leaves of trees are also used as fertilizers",
            "fertilizers used in organic farming are cow dung and green leaves",
            "Rice farming requires Nutrients such as Nitrogen,Phophorous,Potasium",
            "N,P,K are fertilizers used for growing Rice" ,
            "cow dung,green leaves",
            "Fertilizers used in farming of rice are Nitrogen,Zinc,FYM",
            "Growing of rice requires  Fertilizers like Iron,zinc,FYM",
            "dung of animals like buffalo,sheep,goat are used as organic fertilizers ",
            "Nitrogen,urea are also used as nutrients for Rice",
            "N is used as fertilizer for rice",
            "Nitrogen,Phophorous and Potasium are utilised as fertilizers for rice production",
            "Fertilizers utilised for growing of Rice are N,P,K, Nitrogen,Potassium",
            "Best fertilizers used for growinig rice are Iron,zinc",
            "Iron,Zinc,Nitrogen ,Potassium,phosphorous are best fertilizers for growing of rice",
            "Nutrients Nitrogen ,Phophorous , Potassium ,Iron , and zinc apply a basel dose of 750kgs of FYM enriched with fertilizer phosphorous(P at 25kg/ha) apply N and K in 3 splits at 20-25days after germination"
            ,"Potassium fertilization field trials increased yields in 20 percent of the trial sites.","Proper phosphorus (P) nutrition is critical for producing maximum rice grain yields."," Phosphorus is very important in the early vegetative growth stages."," Phosphorus promotes strong early plant growth and development of a strong root system."],
         "responses": ["Fertilizers used for growing rice"],
         "context_set": ""
        },
    

        {"tag": "weather",
         "patterns": ["Rice is grown in hot and humid climate ",
            "hot and humid climatic conditions best suits for the growth of rice",
            "Humid conditions are best for growth of Rice",
            "Hot conditions best suites for rice cultivation",
            "Prolonged sunshine best for rice growth",
            "supply of water is must for rice growth",
            "The climatic conditions required for irrigation of rice is hot,high humid,less rainfall",
            "High levels of humidity are required for rice production",
            "It requires less rainfall for growing",
            "Rice mainly grown in climatic conditions such as less rainfall, Humid conditions,Hot conditions",
            "Rice crop is best suite to regions which have high humidity,Prolonged sunshine and assured supply of water"],
         "responses": ["climatic conditionds"],
         "context_set": ""  
        },
        
        {
            "tag": "attemp",
    "patterns": ["Rice is grown where the average temperature during the growing season is between 20°C and 27°C",
                "The average temperature required for growing rice is between 20°C and 27°C ",
                "The minimum temperature required is 15°C" ,
                "The maximum temperature required is 37°C",
                "Through out the life period of crop the average temperature should be from 21°C and 37°C",
            "The average temperature required through out the life period of the crop ranges from 21°C and 37°C",
            "The optimum temperature for ricce production is 30°C",
            "The rice require high temperature for growing",
                "The optimum temperature for rice cultivation is between 25°C and 35°C",
    "Rice being a tropical and sub-tropical plant, requires a fairly high temperature, ranging from 20° to 40°C.","The optimum temperature of 30°C during day time and 20°C during night time is considered favorable for its growth and development."],
             "responses": ["Temperature conditionds"],
                "context_set": ""
        },
       
        {
         "tag": "diseases",
         "patterns": ["There are five major diseases of rice rice blast,brown spot of rice,sheath blight of rice, bacterial leaf blight, sheath rot of rice, funcgal diseases","Rice blast (Pyricularia grisea) is a fungus that feeds on the rice plant, causing severe damage usually during the seedling stage.","Blast is considered a major disease of rice because of its wide distribution and extent of destruction under favorable conditions.","Bacterial blight is caused by Xanthomonas oryzaepv. oryzae (Xoo) and affects the rice plant at the seedling stage where infected leaves turn grayish green and roll up"," Rice sheath blight is found in all rice production areas, and is decreasing rice production especially in intensified production systems","Diseases are mainly caused by bacteria, viruses, or fungi.","Zinc deficiency causes Khaira disease in rice grown in the calcareous soil of north India."],
         "responses": ["adding it"],
         "context_set": ""
        }
   ]
}
